## Plan Result (shares-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/184060)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 1 to add, 1 to change, 1 to destroy.</code></pre>

* Update
  * aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharesAPI-Prod:35" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharesAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        # (1 unchanged element hidden)
                        {
                            name  = "ENVIRONMENT"
                            value = "production"
                        },
                      + {
                          + name  = "EVENT_BUS_NAME"
                          + value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                        # (4 unchanged elements hidden)
                    ]
                    name                   = "app"
                    # (11 unchanged attributes hidden)
                },
                {
                    command                = [
                        "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                    cpu                    = 0
                    environment            = []
                    essential              = true
                    image                  = "amazon/aws-otel-collector"
                    logConfiguration       = {
                        logDriver     = "awslogs"
                        options       = {
                            awslogs-group             = "/Backend/SharesAPI-Prod/ecs/aws-otel-collector"
                            awslogs-multiline-pattern = "^\\S.+"
                            awslogs-region            = "us-east-1"
                            awslogs-stream-prefix     = "ecs"
                        }
                        secretOptions = []
                    }
                    mountPoints            = []
                    name                   = "aws-otel-collector"
                    portMappings           = [
                        {
                            containerPort = 4138
                            hostPort      = 4138
                            protocol      = "tcp"
                        },
                        {
                            containerPort = 4137
                            hostPort      = 4137
                            protocol      = "tcp"
                        },
                    ]
                    readonlyRootFilesystem = false
                    repositoryCredentials  = {
                        credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                    systemControls         = []
                    volumesFrom            = []
                },
            ] # forces replacement
        )
      ~ id                       = "SharesAPI-Prod" -> (known after apply)
      ~ revision                 = 35 -> (known after apply)
        tags                     = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "SharesAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # aws_iam_policy.application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6 will be updated in-place
  ~ resource "aws_iam_policy" "application_ecs_service_ecs-iam_ecs-task-role-policy_6FC89FB6" {
        id               = "arn:aws:iam::996905175585:policy/SharesAPI-Prod-TaskRolePolicy"
        name             = "SharesAPI-Prod-TaskRolePolicy"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (2 unchanged elements hidden)
                    {
                        Action   = [
                            "sqs:SendMessageBatch",
                            "sqs:SendMessage",
                            "sqs:ReceiveMessage",
                            "sqs:DeleteMessage",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:sqs:us-east-1:996905175585:SharesAPI-Prod-Batch-Delete-Consumer-Queue"
                    },
                  + {
                      + Action   = "events:PutEvents"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:events:us-east-1:996905175585:event-bus/PocketEventBridge-Prod-Shared-Event-Bus"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {
            "costCenter"  = "Pocket"
            "environment" = "Prod"
            "owner"       = "Pocket"
            "service"     = "SharesAPI"
        }
        # (5 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ ecs-task-arn           = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharesAPI-Prod:35" -> (known after apply)
```

</details>









<!-- github-comment: {"Command":"plan","JobID":"153039c5-106e-474f-9b5a-eaf566f0e2c9","JobName":"shares-api_infrastructure_plan_prod","PRNumber":544,"Program":"tfcmt","SHA1":"d9476dcb32dce29d682582abd9bbfbb90e5bcb08","Target":"shares-api-cdk","Vars":{}} -->